import 'dart:convert';
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:flutter/services.dart';
import 'package:flutter_bloc/flutter_bloc.dart';
import 'package:islamic/layout/states/states.dart';
import 'package:islamic/models/zeker-model.dart';
import 'package:vibration/vibration.dart';

import '../../shared/components/compomemts.dart';

class IslamicCubit extends Cubit<IslamicStates> {
  IslamicCubit() : super(IslamicInitialState());

  static IslamicCubit get(context) => BlocProvider.of(context);

  List<BottomNavigationBarItem> bottomItems = [
    BottomNavigationBarItem(icon: Icon(Icons.book), label: 'المصجف'),
    BottomNavigationBarItem(
        icon: Icon(Icons.format_indent_decrease), label: 'الفهرس'),
    BottomNavigationBarItem(icon: Icon(Icons.menu), label: 'المزيد'),
  ];

  void reset1(int index) {
    count[index] = resetList[index];
    emit(IslamicResetBtnPressed());
  }

  void swam(int index) {
    if (count[index] > 0) {
      count[index]--;
      if (count[index] == 0) {
        Vibration.vibrate(duration: 100);
        int sum = 0;
        for (int i = 0; i <= 12; i++) {
          sum = sum + count[i];
        }

        if (sum == 0) {
          showToast(message: 'تقبل الله', states: ToastStates.SUCCESS);
          Vibration.vibrate(duration: 800);
        }
      }
    }
    emit(IslamicSwamBtnPressed());
  }

  int zekrSwam(int count) {
    if (count > 0) {
      count--;
      if (count == 0) {
        Vibration.vibrate(duration: 100);
      }
    }
    emit(IslamicSwamBtnPressed());
    return count;
  }

  int tasbeh = 0;
  int takber = 0;
  int thmed = 0;
  int stekhfar = 0;
  int slahalaehnabe = 0;
  String wheelSelectItem = 'التسبيح';

  void swamBtnPressed() {
    if (wheelSelectItem == 'التكبير') {
      takber++;
    }
    if (wheelSelectItem == 'التحميد') {
      thmed++;
    }
    if (wheelSelectItem == 'الاستغفار') {
      stekhfar++;
    }
    if (wheelSelectItem == 'الصلاه علي النبي') {
      slahalaehnabe++;
    }
    if (wheelSelectItem == 'التسبيح') {
      tasbeh++;
    }

    emit(IslamicSwamBtnPressed());
  }

  void wheelChanged(String selectedItem) {
    wheelSelectItem = selectedItem;
    emit(IslamicWheelChange());
  }

  void reset() {
    tasbeh = 0;
    takber = 0;
    thmed = 0;
    stekhfar = 0;
    slahalaehnabe = 0;
    Vibration.vibrate(duration: 800);
    emit(IslamicResetBtnPressed());
  }

  Zeker? zeker;
  List<ZekerData> items = [];
  Future<void> readJson() async {
    final String response =
        await rootBundle.loadString('assets/jason/zeker.json');
    final data = await json.decode(response);
    zeker = Zeker.fromJason(data);
    zeker!.data.forEach((element) {
      items.add(element);
    });
    emit(IslamicReadJasonSuccessState());
  }

  var category = [
    'أذكار الصباح',
    'أذكار المساء',
    'أذكار الاستيقاظ من النوم',
    'دعاء لبس الثوب',
    'دعاء لبس الثوب الجديد',
    'ما يقول إذا وضع الثوب',
    'دعاء دخول الخلاء - الحمام',
    'دعاء الخروج من الخلاء - الحمام',
    'الذكر قبل الوضوء',
    'الذكر بعد الفراغ من الوضوء',
    'الذكر عند الخروج من المنزل',
    'الذكر عند دخول المنزل',
    'دعاء الذهاب إلى المسجد',
    'دعاء دخول المسجد',
    'دعاء الخروج من المسجد',
    'أذكار الآذان',
    'دعاء الاستفتاح',
    'دعاء الركوع',
    'دعاء الرفع من الركوع',
    'دعاء السجود',
    'دعاء الجلسة بين السجدتين',
    'دعاء سجود التلاوة',
    'التشهد',
    'الصلاة على النبي بعد التشهد',
    'الدعاء بعد التشهد الأخير قبل السلام',
    'الأذكار بعد السلام من الصلاة',
    'دعاء صلاة الاستخارة',
    'أذكار النوم',
    'الدعاء إذا تقلب في الليل',
    'دعاء الفزع في النوم و من بلي بالوحشة',
    'ما يفعل من رأى الرؤيا أو الحلم في النوم',
    'دعاء قنوت الوتر',
    'الذكر عقب السلام من الوتر',
    'دعاء الهم والحزن',
    'دعاء الكرب',
    'دعاء لقاء العدو و ذي السلطان',
    'دعاء من خاف ظلم السلطان',
    'الدعاء على العدو',
    'ما يقول من خاف قوما',
    'دعاء من أصابه وسوسة في الإيمان',
    'دعاء قضاء الدين',
    'دعاء الوسوسة في الصلاة و القراءة',
    'دعاء من استصعب عليه أمر',
    'ما يقول ويفعل من أذنب ذنبا',
    'دعاء طرد الشيطان و وساوسه',
    'الدعاء حينما يقع ما لا يرضاه أو غلب على أمره',
    'ﺗﻬنئة المولود له وجوابه',
    'ما يعوذ به الأولاد - رقية',
    'الدعاء للمريض في عيادته',
    'فضل عيادة المريض',
    'دعاء المريض الذي يئس من حياته',
    'تلقين المحتضر',
    'دعاء من أصيب بمصيبة',
    'الدعاء عند إغماض الميت',
    'الدعاء للميت في الصلاة عليه',
    'الدعاء للفرط في الصلاة عليه',
    'دعاء التعزية',
    'الدعاء عند إدخال الميت القبر',
    'الدعاء بعد دفن الميت',
    'دعاء زيارة القبور',
    'دعاء الريح',
    'دعاء الرعد',
    'من أدعية الاستسقاء',
    'الدعاء إذا نزل المطر',
    'الذكر بعد نزول المطر',
    'من أدعية الاستصحاء',
    'دعاء رؤية الهلال',
    'الدعاء عند إفطار الصائم - الصوم'
        'الدعاء قبل الطعام',
    'الدعاء عند الفراغ من الطعام',
    'دعاء الضيف لصاحب الطعام',
    'التعريض بالدعاء لطلب الطعام أو الشراب',
    'الدعاء إذا أفطر عند أهل بيت - طعام',
    'دعاء الصائم إذا حضر الطعام ولم يفطر',
    'ما يقول الصائم إذا سابه أحد',
    'الدعاء عند رؤية باكورة الثمر',
    'دعاء العطاس',
    'ما يقال للكافر إذا عطس فحمد الله',
    'الدعاء للمتزوج',
    'دعاء المتزوج و شراء الدابة',
    'الدعاء قبل إتيان الزوجة - الجماع',
    'دعاء الغضب',
    'دعاء من رأى مبتلى',
    'ما يقال في اﻟﻤﺠلس',
    'كفارة اﻟﻤﺠلس',
    'الدعاء لمن قال غفر الله لك',
    'الدعاء لمن صنع إليك معروفا',
    'ما يعصم الله به من الدجال',
    'الدعاء لمن قال إني أحبك في الله',
    'الدعاء لمن عرض عليك ماله',
    'الدعاء لمن أقرض عند القضاء',
    'دعاء الخوف من الشرك',
    'الدعاء لمن قال بارك الله فيك',
    'دعاء كراهية الطيرة',
    'دعاء الركوب',
    'دعاء السفر',
    'دعاء دخول القرية أو البلدة',
    'دعاء دخول السوق',
    'الدعاء إذا تعس المركوب',
    'دعاء المسافر للمقيم',
    'دعاء المقيم للمسافر',
    'التكبير و التسبيح في سير السفر',
    'دعاء المسافر إذا أسحر',
    'الدعاء إذا نزل مترلا في سفر أو غيره',
    'ذكر الرجوع من السفر',
    'ما يقول من أتاه أمر يسره أو يكرهه',
    'فضل الصلاة على النبي صلى الله عليه و سلم',
    'إفشاء السلام',
    'كيف يرد السلام على الكافر إذا سلم',
    'الدعاء عند سماع صياح الديك ونهيق الحمار',
    'دعاء نباح الكلب بالليل',
    'الدعاء لمن سببته',
    'ما يقول المسلم إذا مدح المسلم',
    'ما يقول المسلم إذا زكي',
    'كيف يلبي المحرم في الحج أو العمرة ؟',
    'التكبير إذا أتى الركن الأسود',
    'الدعاء بين الركن اليماني والحجر الأسود',
    'دعاء الوقوف على الصفا والمروة',
    'الدعاء يوم عرفة',
    'الذكر عند المشعر الحرام',
    'التكبير عند رمي الجمار مع كل حصاة',
    'دعاء التعجب والأمر السار',
    'ما يفعل من أتاه أمر يسره',
    'ما يقول من أحس وجعا في جسده',
    'دعاء من خشي أن يصيب شيئا بعينه',
    'ما يقال عند الفزع',
    'ما يقول عند الذبح أو النحر',
    'ما يقول لرد كيد مردة الشياطين',
    'الاستغفار و التوبة',
    'التسبيح، التحميد، التهليل، التكبير',
    'كيف كان النبي يسبح؟',
    'من أنواع الخير والآداب الجامعة',
    'الرُّقية الشرعية من القرآن الكريم',
    'الرُّقية الشرعية من السنة النبوية',
  ];

  List<String> names = [
    'الفاتحة',
    'البقرة',
    'ءال عمران',
    'النساء',
    'المَائدة',
    'الأنعَام',
    'الأعرَاف',
    'الأنفَال',
    'التوبَة',
    'يُونس',
    'هُود',
    'يُوسُف',
    'الرَّعْد',
    'إبراهِيم',
    'الحِجْر',
    'النَّحْل',
    'الإسْرَاء',
    'الكهْف',
    'مَريَم',
    'طه',
    'الأنبيَاء',
    'الحَج',
    'المُؤمنون',
    'النُّور',
    'الفُرْقان',
    'الشُّعَرَاء',
    'النَّمْل',
    'القَصَص',
    'العَنكبوت',
    'الرُّوم',
    'لقمَان',
    'السَّجدَة',
    'الأحزَاب',
    'سَبَأ',
    'فَاطِر',
    'يس',
    'الصَّافات',
    'ص',
    'الزُّمَر',
    'غَافِر',
    'فُصِّلَتْ',
    'الشُّورَى',
    'الزُّخْرُف',
    'الدخَان',
    'الجَاثيَة',
    'الأحْقاف',
    'محَمَّد',
    'الفَتْح',
    'الحُجرَات',
    'ق',
    'الذَّاريَات',
    'الطُّور',
    'النَّجْم',
    'القَمَر',
    'الرَّحمن',
    'الوَاقِعَة',
    'الحَديد',
    'المجَادلة',
    'الحَشر',
    'المُمتَحنَة',
    'الصَّف',
    'الجُمُعَة',
    'المنَافِقون',
    'التغَابُن',
    'الطلَاق',
    'التحْريم',
    'المُلْك',
    'القَلَم',
    'الحَاقَّة',
    'المعَارج',
    'نُوح',
    'الجِن',
    'المُزَّمِّل',
    'المُدَّثِّر',
    'القِيَامَة',
    'الإنسَان',
    'المُرسَلات',
    'النَّبَأ',
    'النّازعَات',
    'عَبَس',
    'التَّكوير',
    'الانفِطار',
    'المطفِّفِين',
    'الانْشِقَاق',
    'البرُوج',
    'الطَّارِق',
    'الأَعْلى',
    'الغَاشِية',
    'الفَجْر',
    'البَلَد',
    'الشَّمْس',
    'الليْل',
    'الضُّحَى',
    'الشَّرْح',
    'التِّين',
    'العَلَق',
    'القَدْر	',
    'البَينَة',
    'الزلزَلة	',
    'العَادِيات',
    'القَارِعة',
    'التَّكَاثر',
    'العَصْر',
    'الهُمَزَة',
    'الفِيل',
    'قُرَيْش',
    'المَاعُون',
    'الكَوْثَر',
    'الكَافِرُون',
    'النَّصر',
    'المَسَد',
    'الإخْلَاص',
    'الفَلَق',
    'النَّاس',
  ];

  List<int> pageNumbers = [
    1,
    2,
    45,
    69,
    95,
    115,
    136,
    160,
    169,
    187,
    199,
    212,
    225,
    231,
    237,
    242,
    255,
    266,
    277,
    284,
    294,
    302,
    311,
    319,
    329,
    335,
    345,
    354,
    364,
    371,
    377,
    381,
    383,
    393,
    399,
    404,
    410,
    417,
    422,
    431,
    439,
    445,
    451,
    457,
    460,
    464,
    468,
    472,
    477,
    479,
    482,
    485,
    487,
    490,
    493,
    496,
    499,
    504,
    507,
    510,
    513,
    515,
    516,
    518,
    520,
    522,
    524,
    526,
    529,
    531,
    533,
    534,
    537,
    538,
    540,
    542,
    544,
    545,
    547,
    548,
    550,
    551,
    552,
    553,
    554,
    555,
    556,
    556,
    557,
    559,
    559,
    560,
    561,
    561,
    562,
    562,
    563,
    563,
    564,
    564,
    565,
    565,
    566,
    566,
    566,
    567,
    567,
    567,
    568,
    568,
    568,
    569,
    569,
    569,
  ];

  List<String> texts = [
    'أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الل.اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام.  ',
    'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.',
    'لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.',
    'سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر. ',
    'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير. ',
    ' قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ',
    'قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ .',
    'قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
    'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.',
    'لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير',
    'اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً.',
    'اللَّهُمَّ أَجِرْنِي مِنْ النَّار.',
    'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.'
  ];

  List<int> count = [1, 1, 1, 33, 1, 3, 3, 3, 1, 10, 1, 7, 1];
  List<int> resetList = [1, 1, 1, 33, 1, 3, 3, 3, 1, 10, 1, 7, 1];
}
